package Lesson_36;

public class MethodParam2 {

	public static void main(String[] args) {
		
		/*Способи передавання параметрів у методи*/
		/*В Java є два сопособи передавання аргументів методу:
		 * 1. по значенню (by value)(працює з копією)
		 *    (Javs створює копію значення змінної-аргумента, і викликає метод
		 *     працює з цією копією, не чіпаючи оригінал)
		 * 2. за посилання (by reference)(працює з оригіналом)
		 *    (Java дозволяє викликаному методу працювати напряму зі значенням
		 *     змінної-оригіналу, яка була використана в якості аргумента при виклику)*/
		
		int a = 1 , b = 5;
		int rezult = OpratsjuvatyDani(a, b);// - () - це аргументи, які передаються методу
		System.out.println(rezult);
		System.out.println(a);
		System.out.println(b);
		
		//________________________________________________________
		
		int [] myMasyv = {1, 2, 3};
		OpratsjuvatyDaniMasyv(myMasyv);//ми цей метод викликажмо зразу бо він нічого не повертає
		for (int i : myMasyv)
		{
			System.out.println(i);// коли є один рядок коду то не обов'язково вказути фігруні дужки
		}
		/*Увага не зважаючи на те що в main myMasyv а в методі  int[] m 
		 * ці обитва методи майн і опрацювати дані масив працюють з одним і тим же елементом в
		 * памяті компютера тобто ці обидва методи працють з одинм і тим самим масивом в пам'яті
		 * комп'ютера в тому і полягає вся суть в передаванні аргументів за посиланням*/
	}
	public static int OpratsjuvatyDani(int n1, int n2)// тут в () це параметри, які приймає метод
	{
		n1 = n1 * 10;
		n2 = n2 * 100;
		return n1 + n2;
	}
	
	public static void OpratsjuvatyDaniMasyv(int[] m)
	{
		for(int index = 0; index<m.length; index++)
		{
			m[index] = m[index]+1;
		}
	}
	
	

}
