package Lesson_57;
/**
 * Модифікатор final робить так що змінна перед якою він стоїть
 * можна присвоїти лише один раз і його не можна змінити ні за яких 
 * обставин
 * Всі поля які мають модифікатор final - пишуться ВИКЛЮЧНО ВЕЛИКИМИ БУКВАМИ
 * Якщо final стоїть перед методом то він не може бути заміщений (overriding) при успадкуванні
 * Якщо final стоїть перед класом то він не може бути успадкований, (наслідуваний) 
 * @author Ростислав
 *
 */
public class MainFinal {

	public static void main(String[] args) {
		/*Модифікатор Final*/
		
		

	}

}
